In [1]:
import pandas as pd

df = pd.read_csv('survey.csv') # , index_col='COL_NAME' is optional to set up specific index if you need
df.shape #gives us ROWs and COLs count

(64461, 61)

In [2]:
df.info() #if you need more info about DATA TYPES (strings, ints etc)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64461 entries, 0 to 64460
Data columns (total 61 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Respondent                    64461 non-null  int64
 1   MainBranch                    64162 non-null  object
 2   Hobbyist                      64416 non-null  object
 3   Age                           45446 non-null  float64
 4   Age1stCode                    57900 non-null  object
 5   CompFreq                      40069 non-null  object
 6   CompTotal                     34826 non-null  float64
 7   ConvertedComp                 34756 non-null  float64
 8   Country                       64072 non-null  object
 9   CurrencyDesc                  45472 non-null  object
 10  CurrencySymbol                45472 non-null  object
 11  DatabaseDesireNextYear        44070 non-null  object
 12  DatabaseWorkedWith            49537 non-null  object
 13  DevType                       49370 non-null  object
 14  EdLevel                       57431 non-null  object
 15  Employment                    63854 non-null  object
 16  Ethnicity                     45948 non-null  object
 17  Gender                        50557 non-null  object
 18  JobFactors                    49349 non-null  object
 19  JobSat                        45194 non-null  object
 20  JobSeek                       51727 non-null  object
 21  LanguageDesireNextYear        54113 non-null  object
 22  LanguageWorkedWith            57378 non-null  object
 23  MiscTechDesireNextYear        42379 non-null  object
 24  MiscTechWorkedWith            40314 non-null  object
 25  NEWCollabToolsDesireNextYear  47287 non-null  object
 26  NEWCollabToolsWorkedWith      52883 non-null  object
 27  NEWDevOps                     42686 non-null  object
 28  NEWDevOpsImpt                 41732 non-null  object
 29  NEWEdImpt                     48465 non-null  object
 30  NEWJobHunt                    42286 non-null  object
 31  NEWJobHuntResearch            41022 non-null  object
 32  NEWLearn                      56156 non-null  object
 33  NEWOffTopic                   50804 non-null  object
 34  NEWOnboardGood                42623 non-null  object
 35  NEWOtherComms                 57205 non-null  object
 36  NEWOvertime                   43231 non-null  object
 37  NEWPurchaseResearch           37321 non-null  object
 38  NEWPurpleLink                 54803 non-null  object
 39  NEWSOSites                    58275 non-null  object
 40  NEWStuck                      54983 non-null  object
 41  OpSys                         56228 non-null  object
 42  OrgSize                       44334 non-null  object
 43  PlatformDesireNextYear        50605 non-null  object
 44  PlatformWorkedWith            53843 non-null  object
 45  PurchaseWhat                  39364 non-null  object
 46  Sexuality                     43992 non-null  object
 47  SOAccount                     56805 non-null  object
 48  SOComm                        56476 non-null  object
 49  SOPartFreq                    46792 non-null  object
 50  SOVisitFreq                   56970 non-null  object
 51  SurveyEase                    51802 non-null  object
 52  SurveyLength                  51701 non-null  object
 53  Trans                         49345 non-null  object
 54  UndergradMajor                50995 non-null  object
 55  WebframeDesireNextYear        40024 non-null  object
 56  WebframeWorkedWith            42279 non-null  object
 57  WelcomeChange                 52683 non-null  object
 58  WorkWeekHrs                   41151 non-null  float64
 59  YearsCode                     57684 non-null  object
 60  YearsCodePro                  46349 non-null  object
dtypes: float64(4), int64(1), object(56)
memory usage: 30.0+ MB

In [3]:
# once we know how many ROWs x COLs we've got, 
# we might tweak options to show all COLs for example:
pd.set_option('display.max_columns', 61) # max 61 COLs now, check df.head(1)
df.head(1) # here we go:

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,CurrencySymbol,DatabaseDesireNextYear,DatabaseWorkedWith,DevType,EdLevel,Employment,Ethnicity,Gender,JobFactors,JobSat,JobSeek,LanguageDesireNextYear,LanguageWorkedWith,MiscTechDesireNextYear,MiscTechWorkedWith,NEWCollabToolsDesireNextYear,NEWCollabToolsWorkedWith,NEWDevOps,NEWDevOpsImpt,NEWEdImpt,NEWJobHunt,NEWJobHuntResearch,NEWLearn,NEWOffTopic,NEWOnboardGood,NEWOtherComms,NEWOvertime,NEWPurchaseResearch,NEWPurpleLink,NEWSOSites,NEWStuck,OpSys,OrgSize,PlatformDesireNextYear,PlatformWorkedWith,PurchaseWhat,Sexuality,SOAccount,SOComm,SOPartFreq,SOVisitFreq,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,EUR,Microsoft SQL Server,Elasticsearch;Microsoft SQL Server;Oracle,"Developer, desktop or enterprise applications;...","Masterâ€™s degree (M.A., M.S., M.Eng., MBA, etc.)","Independent contractor, freelancer, or self-em...",White or of European descent,Man,"Languages, frameworks, and other technologies ...",Slightly satisfied,I am not interested in new job opportunities,C#;HTML/CSS;JavaScript,C#;HTML/CSS;JavaScript,.NET Core;Xamarin,.NET;.NET Core,Microsoft Teams;Microsoft Azure;Trello,Confluence;Jira;Slack;Microsoft Azure;Trello,No,Somewhat important,Fairly important,NaN,NaN,Once a year,Not sure,NaN,No,Often: 1-2 days per week or more,Start a free trial;Ask developers I know/work ...,Amused,Stack Overflow (public Q&A for anyone who codes),Visit Stack Overflow;Go for a walk or other ph...,Windows,2 to 9 employees,Android;iOS;Kubernetes;Microsoft Azure;Windows,Windows,NaN,Straight / Heterosexual,No,"No, not at all",NaN,Multiple times per day,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27

In [4]:
# You can create your own data frames from structures 
# (list, sets for example). Lets take a look:
people = {
    'name': ['Power', 'Rangers', 'Ritta'],
    'last_name': ['Zordon', 'Hulk', 'SikiTa'],
    'age': [22, 11, 33]
}
# and now lets transfer it into data frame:
new_df = pd.DataFrame(people)
new_df

      name last_name  age
0    Power    Zordon   22
1  Rangers      Hulk   11
2    Ritta    SikiTa   33

In [5]:
# We have DataFrames and Series:
print(type(new_df['name']), type(new_df))

<class 'pandas.core.series.Series'> <class 'pandas.core.frame.DataFrame'>

In [6]:
# Series: a list of data, but has more functionality than a python list. It's 1-D array.
# DataFrame: 2-D array; think of it as ROWs and COLs. It is a container for 
# multiple of series object

In [7]:
new_df[['name', 'age']] # we may acces few COLs like this

      name  age
0    Power   22
1  Rangers   11
2    Ritta   33

In [8]:
# GET A COLUMN:
# use .columns to grab some specific COL:
new_df.columns

Index(['name', 'last_name', 'age'], dtype='object')

In [9]:
# GET A ROW:
# use .loc[] or .iloc[] to grab a ROW
# iloc[] - allows access ROWs by INT location, hence the name - integerLocation. 
# Say we wanna access 1st ROW using iloc, we use:
new_df.iloc[0]
# we might also access couple rows:
new_df.iloc[[0, 1]]

      name last_name  age
0    Power    Zordon   22
1  Rangers      Hulk   11

### what is more, we might access also data by providing **<u>ROWS-COLS</u>** with iloc and loc:

In [10]:
# what is more, we might access also data by providing ROWs-COLs with iloc:
new_df.iloc[[0, 1], [1, 2]] # since its iloc then INTEGERS ONLY! new_df.iloc[[0, 1], [2]]
# works too for 1 COL but few ROWs (we could have provided name of COL if it was loc)

  last_name  age
0    Zordon   22
1      Hulk   11

In [11]:
# loc - gets ROWs (x COLs as 2nd arg) of LABELS/STRING this time, not INT
# but dont get confused, right now our new_df has on the very left some "numbers",
# in fact they are labels but we will cover it in further notes

In [12]:
new_df.loc[[0, 1], ['name', 'age']] # NOTICE we call to COLs by labels
# and ofc you could have called 1 col too: ... .loc[[0, 1], ['name']]

      name  age
0    Power   22
1  Rangers   11

In [108]:
schema = pd.read_csv('schema.csv')
schema.head(1)

       Column                                       QuestionText
0  Respondent  Randomized respondent ID number (not in order ...

In [14]:
df['Hobbyist'].value_counts() # just a quick taste, counts vals (yes and no) in this COL

Yes    50388
No     14028
Name: Hobbyist, dtype: int64

In [15]:
df.loc[[0], ['Hobbyist']] # this is SERIES but we can get STR only via: df.loc[0, 'Hobbyist']; check types :)

  Hobbyist
0      Yes

In [16]:
df.loc[0] # all data user 1 (on index 0) filled and had to answer - example:

Respondent                                                  1
MainBranch                     I am a developer by profession
Hobbyist                                                  Yes
Age                                                       NaN
Age1stCode                                                 13
                                       ...
WebframeWorkedWith                       ASP.NET;ASP.NET Core
WelcomeChange         Just as welcome now as I felt last year
WorkWeekHrs                                              50.0
YearsCode                                                  36
YearsCodePro                                               27
Name: 0, Length: 61, dtype: object

In [18]:
# IMPORTANT: if you passing a slice, say df.loc[0:2, ['COL_NAME']] notice that we dont use brackets in slices, 
# and slices are INCLUSIVE so will print from 0 and indluding 2 results:
df.loc[0:2, ['Hobbyist']] # do you know the difference between df.loc[0:2, 'Hobbyist']??? 
# First one is DF and second SERIES,
# you can nicely loop through SERIES values: z = df.loc[0:2, 'Hobbyist']; for i in z: print(i)...
# if you want VALs from DF, you had to do: z = df.loc[0:2, ['Hobbyist']]; 
# for i, j in z.items(): for x in j: print(x)...
#
# or even better with .iterrows():
for index, row in df.iterrows():
    print(index, row['Age']) # or just print(index, row)

  Hobbyist
0      Yes
1       No
2      Yes

In [19]:
# we may also use these slices INCLUSIVE on COLs:
df.loc[0:2, 'Hobbyist':'Employment'] # look at COL slice, you can alsways check names of COLs by df.columns

,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,CurrencySymbol,DatabaseDesireNextYear,DatabaseWorkedWith,DevType,EdLevel,Employment
0,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,EUR,Microsoft SQL Server,Elasticsearch;Microsoft SQL Server;Oracle,"Developer, desktop or enterprise applications;...","Masterâ€™s degree (M.A., M.S., M.Eng., MBA, etc.)","Independent contractor, freelancer, or self-em..."
1,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,GBP,NaN,NaN,"Developer, full-stack;Developer, mobile","Bachelorâ€™s degree (B.A., B.S., B.Eng., etc.)",Employed full-time
2,Yes,NaN,15,NaN,NaN,NaN,Russian Federation,NaN,NaN,NaN,NaN,NaN,NaN,NaN

---
## Let's talk deeper about INDEXES (set, reset, use indexes):

In [26]:
people2 = {
    'name': ['Power', 'Rangers', 'Ritta'],
    'email': ['Zordon@gf.gg', 'Hulk@wp.gg', 'SikiTa@gg.gg'],
    'age': [22, 11, 33]
}
new_df2 = pd.DataFrame(people2)
new_df2  # we have this data generated from dict PEOPLE above

      name         email  age
0    Power  Zordon@gf.gg   22
1  Rangers    Hulk@wp.gg   11
2    Ritta  SikiTa@gg.gg   33

In [24]:
# lets make these indexes (unique), so use email address:
new_df2['email'] # !everytime you use double square brackets, 
# even for one COL, it makes data as DF -->: new_df2[['email']]

0    Zordon@gf.gg
1      Hulk@wp.gg
2    SikiTa@gg.gg
Name: email, dtype: object

In [28]:
new_df2.set_index('email') # NOTICE that it DOES NOT changes our original DataFrame! look below, it retains the state declared on the very first run

                 name  age
email
Zordon@gf.gg    Power   22
Hulk@wp.gg    Rangers   11
SikiTa@gg.gg    Ritta   33

In [30]:
new_df2 # see, no changes on index in our original state, which is awesome
# but what if you indeed want to modify it for permanent change? just add an argument: ... , inplace=True). Looks like this:
# new_df2.set_index('email', inplace=True) # so this will permanently modify our DataFrame. Actually lets see this in action below

      name         email  age
0    Power  Zordon@gf.gg   22
1  Rangers    Hulk@wp.gg   11
2    Ritta  SikiTa@gg.gg   33

In [32]:
new_df2.index # proof of current indexes:

RangeIndex(start=0, stop=3, step=1)

In [37]:
# and now after changes:
new_df2.set_index('email', inplace=True) # inplace arg makes PERMANENT CHANGE
new_df2.index # proof of current indexes AFTER changes:

Index(['Zordon@gf.gg', 'Hulk@wp.gg', 'SikiTa@gg.gg'], dtype='object', name='email')

In [46]:
# since we have indexes now as string, it's great to show you .loc and .iloc again in action:
new_df2.iloc[0] # .iloc[]

name    Power
age        22
Name: Zordon@gf.gg, dtype: object

In [49]:
new_df2.loc['Zordon@gf.gg'] # .loc[]

name    Power
age        22
Name: Zordon@gf.gg, dtype: object

In [50]:
new_df2

                 name  age
email
Zordon@gf.gg    Power   22
Hulk@wp.gg    Rangers   11
SikiTa@gg.gg    Ritta   33

In [55]:
# Back to our df DataFrame (survey.csv), time to do some clean ups. Lets begin from indexes. 
# Notice COL Respondent - seems like this is unique id, so lets make it as indexes in our data Frame:
df.head(2)

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,CurrencySymbol,DatabaseDesireNextYear,DatabaseWorkedWith,DevType,EdLevel,Employment,Ethnicity,Gender,JobFactors,JobSat,JobSeek,LanguageDesireNextYear,LanguageWorkedWith,MiscTechDesireNextYear,MiscTechWorkedWith,NEWCollabToolsDesireNextYear,NEWCollabToolsWorkedWith,NEWDevOps,NEWDevOpsImpt,NEWEdImpt,NEWJobHunt,NEWJobHuntResearch,NEWLearn,NEWOffTopic,NEWOnboardGood,NEWOtherComms,NEWOvertime,NEWPurchaseResearch,NEWPurpleLink,NEWSOSites,NEWStuck,OpSys,OrgSize,PlatformDesireNextYear,PlatformWorkedWith,PurchaseWhat,Sexuality,SOAccount,SOComm,SOPartFreq,SOVisitFreq,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,EUR,Microsoft SQL Server,Elasticsearch;Microsoft SQL Server;Oracle,"Developer, desktop or enterprise applications;...","Masterâ€™s degree (M.A., M.S., M.Eng., MBA, etc.)","Independent contractor, freelancer, or self-em...",White or of European descent,Man,"Languages, frameworks, and other technologies ...",Slightly satisfied,I am not interested in new job opportunities,C#;HTML/CSS;JavaScript,C#;HTML/CSS;JavaScript,.NET Core;Xamarin,.NET;.NET Core,Microsoft Teams;Microsoft Azure;Trello,Confluence;Jira;Slack;Microsoft Azure;Trello,No,Somewhat important,Fairly important,NaN,NaN,Once a year,Not sure,NaN,No,Often: 1-2 days per week or more,Start a free trial;Ask developers I know/work ...,Amused,Stack Overflow (public Q&A for anyone who codes),Visit Stack Overflow;Go for a walk or other ph...,Windows,2 to 9 employees,Android;iOS;Kubernetes;Microsoft Azure;Windows,Windows,NaN,Straight / Heterosexual,No,"No, not at all",NaN,Multiple times per day,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
1,2,I am a developer by profession,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,GBP,NaN,NaN,"Developer, full-stack;Developer, mobile","Bachelorâ€™s degree (B.A., B.S., B.Eng., etc.)",Employed full-time,NaN,NaN,NaN,Very dissatisfied,I am not interested in new job opportunities,Python;Swift,JavaScript;Swift,React Native;TensorFlow;Unity 3D,React Native,Github;Slack,Confluence;Jira;Github;Gitlab;Slack,NaN,NaN,Fairly important,NaN,NaN,Once a year,Not sure,NaN,No,NaN,NaN,Amused,Stack Overflow (public Q&A for anyone who code...,Visit Stack Overflow;Go for a walk or other ph...,MacOS,"1,000 to 4,999 employees",iOS;Kubernetes;Linux;MacOS,iOS,I have little or no influence,NaN,Yes,"Yes, definitely",Less than once per month or monthly,Multiple times per day,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4

In [57]:
df.set_index('Respondent', inplace=True)

In [59]:
# DONE:
df.head(2) # now we have indexes Responden and they are probably are ints, lets check the type

,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,CurrencySymbol,DatabaseDesireNextYear,DatabaseWorkedWith,DevType,EdLevel,Employment,Ethnicity,Gender,JobFactors,JobSat,JobSeek,LanguageDesireNextYear,LanguageWorkedWith,MiscTechDesireNextYear,MiscTechWorkedWith,NEWCollabToolsDesireNextYear,NEWCollabToolsWorkedWith,NEWDevOps,NEWDevOpsImpt,NEWEdImpt,NEWJobHunt,NEWJobHuntResearch,NEWLearn,NEWOffTopic,NEWOnboardGood,NEWOtherComms,NEWOvertime,NEWPurchaseResearch,NEWPurpleLink,NEWSOSites,NEWStuck,OpSys,OrgSize,PlatformDesireNextYear,PlatformWorkedWith,PurchaseWhat,Sexuality,SOAccount,SOComm,SOPartFreq,SOVisitFreq,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
Respondent,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,EUR,Microsoft SQL Server,Elasticsearch;Microsoft SQL Server;Oracle,"Developer, desktop or enterprise applications;...","Masterâ€™s degree (M.A., M.S., M.Eng., MBA, etc.)","Independent contractor, freelancer, or self-em...",White or of European descent,Man,"Languages, frameworks, and other technologies ...",Slightly satisfied,I am not interested in new job opportunities,C#;HTML/CSS;JavaScript,C#;HTML/CSS;JavaScript,.NET Core;Xamarin,.NET;.NET Core,Microsoft Teams;Microsoft Azure;Trello,Confluence;Jira;Slack;Microsoft Azure;Trello,No,Somewhat important,Fairly important,NaN,NaN,Once a year,Not sure,NaN,No,Often: 1-2 days per week or more,Start a free trial;Ask developers I know/work ...,Amused,Stack Overflow (public Q&A for anyone who codes),Visit Stack Overflow;Go for a walk or other ph...,Windows,2 to 9 employees,Android;iOS;Kubernetes;Microsoft Azure;Windows,Windows,NaN,Straight / Heterosexual,No,"No, not at all",NaN,Multiple times per day,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
2,I am a developer by profession,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,GBP,NaN,NaN,"Developer, full-stack;Developer, mobile","Bachelorâ€™s degree (B.A., B.S., B.Eng., etc.)",Employed full-time,NaN,NaN,NaN,Very dissatisfied,I am not interested in new job opportunities,Python;Swift,JavaScript;Swift,React Native;TensorFlow;Unity 3D,React Native,Github;Slack,Confluence;Jira;Github;Gitlab;Slack,NaN,NaN,Fairly important,NaN,NaN,Once a year,Not sure,NaN,No,NaN,NaN,Amused,Stack Overflow (public Q&A for anyone who code...,Visit Stack Overflow;Go for a walk or other ph...,MacOS,"1,000 to 4,999 employees",iOS;Kubernetes;Linux;MacOS,iOS,I have little or no influence,NaN,Yes,"Yes, definitely",Less than once per month or monthly,Multiple times per day,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4

In [63]:
df.index # as we suspected, they are ints, cool

Int64Index([    1,     2,     3,     4,     5,     6,     7,     8,     9,
               10,
            ...
            64104, 64236, 64330, 64480, 64567, 64858, 64867, 64898, 64925,
            65112],
           dtype='int64', name='Respondent', length=64461)

In [106]:
df.iloc[1, 0]

'I am a developer by profession'

In [111]:
schema.set_index('Column', inplace=True)

In [114]:
schema.head(2)

                                                 QuestionText
Column
Respondent  Randomized respondent ID number (not in order ...
MainBranch  Which of the following options best describes ...

In [117]:
# once you've managed to set custom indexes, you may sort them for example:
schema.sort_index().head(4) # use .sort_index(ascending=False) for reversed order :)

                                                 QuestionText
Column
Age         What is your age (in years)? If you prefer not...
Age1stCode  At what age did you write your first line of c...
CompFreq     Is that compensation weekly, monthly, or yearly?
CompTotal   What is your current total compensation (salar...

In [118]:
# AND REMEMBER, if you want this changes PERMANENT, just add arg: inplace=True.
# so schema.sort_index(inplace=True [, ascending=..., args...]) would be used for PERMA change the DataFrame

---
## Filtering - Using Conditionals to Filter Rows and Columns

In [9]:
import pandas as pd
ppl = {
    'name': ['John', 'Maxim', 'Julian'],
    'last': ['Doe', 'Doe', 'Cesar'],
    'email': ['jnDoe@ff.gg', 'maxim@aa.aa', 'rome4lyfe@gov.it']
}
df2 = pd.DataFrame(ppl)
df2

     name   last             email
0    John    Doe       jnDoe@ff.gg
1   Maxim    Doe       maxim@aa.aa
2  Julian  Cesar  rome4lyfe@gov.it

In [10]:
df2['last'] == 'Doe' # we can filter like that, it returns BOOLEAN, we can use that boolean into loc or inside df2,
# look below:

0     True
1     True
2    False
Name: last, dtype: bool

In [11]:
df2[df2['last'] == 'Doe'] # 1) way; so this or:
fltr = df2['last'] == 'Doe'
df2[fltr] # 2) way; or this:
df2.loc[fltr] # 3) way; or just this:
df2.loc[df2['last'] == 'Doe'] # 4) way. You can put BOOLEANS into .loc - this gives us some advantage because we can
# still GRAB A COLUMN in this notation :)
# So wrap this up - use way 4) or 3) when filtering.

    name last        email
0   John  Doe  jnDoe@ff.gg
1  Maxim  Doe  maxim@aa.aa

In [13]:
# for example I want email COL, I would do:
df2.loc[df2['last'] == 'Doe', ['email']]

         email
0  jnDoe@ff.gg
1  maxim@aa.aa

##### AND and OR operators - we cannot use python built in filters :(

In [21]:
# in filters we use & for AND, also | for OR:
flt = (df2['last'] == 'Doe') & (df2['name'] == 'John') # notice parenthesis, if you would skip it then program throws error
df2.loc[flt, ['email']]
# also you may use NEGATION with tilda ~ at the begning of filter inside df2.loc: df2.loc[~flt, 'email']

         email
0  jnDoe@ff.gg

In [2]:
import pandas as pd

df = pd.read_csv('survey.csv', index_col='Respondent') # this arg (index_col=) is for setting index, but faster
schema = pd.read_csv('schema.csv', index_col="Column") # this arg (index_col=) is for setting index, but faster
df.head(2)

,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,CurrencySymbol,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
Respondent,,,,,,,,,,,,,,,,,,,,,
1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,EUR,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
2,I am a developer by profession,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,GBP,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4

In [4]:
salary = (df['ConvertedComp'] >= 70000)
df.loc[salary, ['Country', 'LanguageWorkedWith', 'ConvertedComp']]

,Country,LanguageWorkedWith,ConvertedComp
Respondent,,,
8,United States,Python;SQL,116000.0
16,United Kingdom,Bash/Shell/PowerShell;HTML/CSS;Java;JavaScript...,108576.0
17,United States,C#;HTML/CSS;JavaScript;Python;SQL;VBA,79000.0
18,United States,Bash/Shell/PowerShell;HTML/CSS;Perl,1260000.0
19,United States,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;S...,83400.0
...,...,...,...
65589,United States,NaN,150000.0
65596,United States,JavaScript;Python;TypeScript,70000.0
65602,United States,NaN,140000.0
65604,United States,NaN,150000.0
65617,Germany,NaN,129718.0

In [9]:
# neat trick with filters:
countries = ['United States', 'Canada', 'United Kingdom', 'Germany', 'India']
flt2 = df['Country'].isin(countries) # flt2 = (df['Country'].isin(['Poland'])) & (df['ConvertedComp'] > 50000)
df.loc[flt2, ['Country', 'LanguageWorkedWith', 'ConvertedComp']]

,Country,LanguageWorkedWith,ConvertedComp
Respondent,,,
1505,Poland,Bash/Shell/PowerShell;Java;JavaScript;SQL,212625.0
1778,Poland,Bash/Shell/PowerShell;C++;Python;Rust,50124.0
1837,Poland,C;C#;HTML/CSS;JavaScript;PHP;SQL,69864.0
2379,Poland,HTML/CSS;JavaScript;TypeScript,110000.0
2445,Poland,Bash/Shell/PowerShell;C#;C++;HTML/CSS;Java;Jav...,58320.0
...,...,...,...
61126,Poland,Haskell;Java,63281.0
61353,Poland,Bash/Shell/PowerShell;HTML/CSS;Java,150000.0
61385,Poland,Bash/Shell/PowerShell;JavaScript,53940.0
61612,Poland,HTML/CSS;JavaScript;PHP;SQL,66828.0
62603,Poland,Java;Scala,51024.0

In [10]:
flt3 = df['LanguageWorkedWith'].str.contains('Python', na=False)
df.loc[flt3, ['Country', 'LanguageWorkedWith', 'ConvertedComp']]

,Country,LanguageWorkedWith,ConvertedComp
Respondent,,,
3,Russian Federation,Objective-C;Python;Swift,NaN
8,United States,Python;SQL,116000.0
10,United Kingdom,HTML/CSS;Java;JavaScript;Python;SQL,32315.0
13,Netherlands,C;JavaScript;Python,38916.0
15,France,Bash/Shell/PowerShell;C;HTML/CSS;Java;Python;SQL,NaN
...,...,...,...
61561,France,Bash/Shell/PowerShell;HTML/CSS;JavaScript;Perl...,NaN
62391,Morocco,C++;HTML/CSS;JavaScript;Python;Ruby;TypeScript,NaN
63077,United States,C++;HTML/CSS;Java;JavaScript;Python;SQL,NaN
63640,Australia,Bash/Shell/PowerShell;C;C#;C++;HTML/CSS;Java;J...,NaN
64867,Morocco,Assembly;Bash/Shell/PowerShell;C;C#;C++;Dart;G...,NaN

In [3]:
# We can change COL VALs with filter like this [DF referring to pokemons]:
flt = (df['type1'] == 'Grass')
df.loc[flt, 'type1'] = 'Test' # so we filter by type1==grass and then change for Test

### REG EX in filters:

In [ ]:
# you may use regex in filtering, there is an arg you can provide: ..., regex=True:
import re
flt = df['last_name'].str.contains('doe|smith', regex=True, flags=re.I) # <<-- flags ignore cases in this example
#
# example 2:
import re
flt = df.name.str.contains('^pi', regex=True, flags=re.I)
df.loc[flt]

---
## Updating Rows and Columns - Modifying Data Within DataFrames
##### It's trivial. Once you have a `DataFrame` assingned to, say, `adf` var, then just use method `.columns = [COL_NAME, COL2_NAME, ...]`:

In [1]:
import pandas as pd

animals = {
    'name': ['Moouse', 'Dogo', 'Mouse'],
    'age': [1, 2, 3],
    'salary': [60000, 30000, 12000],
    'country' : ['CA', 'USA', 'UK'],
    'is_newbe' : [True, False, True]
}
adf = pd.DataFrame(animals)
adf.columns = ['animal_name', 'animal_age', 'animal_salary', 'a_country', 'a_is_newbe'] # HERE WE'R CHANGING COL NAMES
adf.columns # proof

Index(['animal_name', 'animal_age', 'animal_salary', 'a_country',
       'a_is_newbe'],
      dtype='object')

In [2]:
# maybe your col names are small and you want capital letters? :
for i in adf.columns:
    print(i.upper())

ANIMAL_NAME
ANIMAL_AGE
ANIMAL_SALARY
A_COUNTRY
A_IS_NEWBE

In [3]:
# fk it change them permanently to capital letters:
# ['name', 'age', 'salary', 'country', 'is_newbe'] # just want old names but they will be transferred to CAPITALS
adf.columns = [i.upper() for i in adf.columns] # list comprehension instead of full for loop...
# adf.columns = adf.columns.str.lower() # <<-- alternative for list comprehension
adf.columns

Index(['NAME', 'AGE', 'SALARY', 'COUNTRY', 'IS_NEWBE'], dtype='object')

---
### SOME FILTERS REMINDER HERE (and back to topic below):

In [4]:
# my_flt = (adf['SALARY'] < 20000)                                     # 1) filter
# my_flt = (adf['SALARY'] < 20000) & (adf['NAME'].str.contains('use')) # 2) filter: .str.contains(ARG)
# countries = ['UK', 'CA']                                             # 3) filter: .isin(ARG)
# my_flt = adf['COUNTRY'].isin(countries)                              # still 3) filter: .isin(ARG)
# my_flt = adf['IS_NEWBE'].value_counts()                              # 4) filter: .value_counts()
# my_flt # returns True x2 and False x1                                # still 4) filter: .value_counts()
# adf.columns = adf.columns.str.replace(' ', '_')                      # 5) .str.replace() replace in COL spaces to underscore _
# adf.rename(columns={'NAME' : 'first_name', ...}, inplace=True)       # 6) DataFragment.rename(columns={'k':'k2'}) this one renames SPECIFIC COLUMNS, 
                                                                       # say NAME to first_name, ofc param inplace=True is optional - for perma change
my_flt = (adf['COUNTRY'].isin(['CA'])) & (adf['NAME'].str.contains('use'))
adf.loc[my_flt, ['NAME', 'SALARY', 'COUNTRY', 'IS_NEWBE']]

     NAME  SALARY COUNTRY  IS_NEWBE
0  Moouse   60000      CA      True

---
### back to topic now:

In [5]:
# Lets take a look how to update a single value - lets grab a Dogo and change its name for Dog:
adf.loc[[1]]

   NAME  AGE  SALARY COUNTRY  IS_NEWBE
1  Dogo    2   30000     USA     False

In [6]:
adf.loc[[1]] = ['Dog', 2, 30000, 'USA', False] # we modified a single row like this

In [7]:
adf

     NAME  AGE  SALARY COUNTRY  IS_NEWBE
0  Moouse    1   60000      CA      True
1     Dog    2   30000     USA     False
2   Mouse    3   12000      UK      True

In [8]:
# say we have 61 columns, we will not be doing the way above, but this is for specific col:
adf.loc[[1], ['NAME']] = ['Ddoogg'] # you can ofc do for few specific cols, you got this
adf

     NAME  AGE  SALARY COUNTRY  IS_NEWBE
0  Moouse    1   60000      CA      True
1  Ddoogg    2   30000     USA     False
2   Mouse    3   12000      UK      True

In [9]:
# say we want lower letters in columns. you may use .str.lower():
adf['COUNTRY'].str.lower() # see this is not permanent change so you can make it:
adf['COUNTRY'] = adf['COUNTRY'].str.lower() # this is perma change now
adf

     NAME  AGE  SALARY COUNTRY  IS_NEWBE
0  Moouse    1   60000      ca      True
1  Ddoogg    2   30000     usa     False
2   Mouse    3   12000      uk      True

#### Time for methods `apply`, `map`, `applymap`, `replace`:
##### 1. `apply` - can work on either `DataFrame` or `Series` object. Behaviour are different on each object. First lets look how apply works for `Series`.

In [10]:
# btw - side note - I've changed col names for lower : adf.columns = [col.lower() for col in adf.columns]

# apply for SERIES - it will apply for EVERY VALUE. Say I wanna see length of names (function .str.len() would
# be used for that but for SAKE OF DEMONSTRATION WE GONNA USE OUR FUNCTION):
def show_length(name):
    return len(name)

adf['name'].apply(show_length) #NOTICE WE DONT EXECUTE IT WITH show_length(), we pass it without parenthesis!

# OR EXAMPLE NO. 2, we want upper names (we would use faster and easier rdy func .str.upper() but for this example we do our):
def make_upper(name):
    return name.upper()

adf['name'].apply(make_upper) # now lets make perma change:
adf['name'] = adf['name'].apply(make_upper)
adf # proof

     name  age  salary country  is_newbe
0  MOOUSE    1   60000      ca      True
1  DDOOGG    2   30000     usa     False
2   MOUSE    3   12000      uk      True

#### `apply` for `DATA FRAMES` - it just returns values in every columns. For instance if we do apply:

In [11]:
adf.apply(len)

name        3
age         3
salary      3
country     3
is_newbe    3
dtype: int64

In [12]:
# we get this which means we have 3 row data value in Name, etc. This is same as we would do:
len(adf['name']) # for example

3

In [13]:
# and you can also use extra arg like axis="columns" so it will count in rows each col data:
adf.apply(len, axis='columns') # notice 5 data value (counts from left to right, while axis on rows counts from up to bottom)

0    5
1    5
2    5
dtype: int64

---
##### 2. `applymap` - can work only on `Series` object.

In [148]:
# my data frame has some int data, so adf.applymap(len) will not work, cos it works only on strings. but say we have only strings so
# it would return table with each count for row/col
# another good example is to make everywhere lower cases - lets assume our data has strings only - so we would do:
# adf.applymap(str.lower)

In [20]:
# you know what? fk it lets cast str on our salary to show how it works:
# adf['salary'] = adf['salary'].astype('string') ... and same appied for cols that were other types than string
adf.applymap(len) # now we can see this in action

   name  age  salary  country  is_newbe
0     6    1       5        2         4
1     6    1       5        3         5
2     5    1       5        2         4

In [23]:
adf

     name age salary country is_newbe
0  MOOUSE   1  60000      CA     True
1  DDOOGG   2  30000     USA    False
2   MOUSE   3  12000      UK     True

---
##### 3. `map` - can work only on `Series` object as well. For substituin each value in series for another value. Say we wanna substitude a couple of our names

In [24]:
adf['name'].map({'DDOOGG' : 'Dog', 'MOOUSE': 'Mcause'}) # notice val that we DID NOT SUBSTITUDE are in NaN.

0    Mcause
1       Dog
2       NaN
Name: name, dtype: object

##### but what if we want to substitude only speciifc values without other infos? just use
##### 4. `replace`

In [25]:
adf['name'].replace({'DDOOGG' : 'Dog', 'MOOUSE': 'Mcause'}) # you know the drill if you want perma change, just assing it to this col...

0    Mcause
1       Dog
2     MOUSE
Name: name, dtype: object

---
### Dummy Data for Sandbox begins:

<b>We will find here some drills like:
<ol>
    <li>Make DataFrame from dict</li>
    <li>Get emails from COL</li>
    <li>Make COL names SMALL LETTERS - 2 options: OPTION A and OPTION B</li>
    <li><b>Replace/Change</b> spaces to underscore in COL</li>
    <li><b>Rename</b> specific COL names</li>
    <li><b>Get</b> data from COLUMNS and then from 2 COLS</li>
    <li><b>Create new COL</b></li>
    <li>Count how many Yes and No are in COL 'hobbyist'</li>
    <li><b>Delete/Drop</b> COL 'full_name'</li>
    <li>Rule of Thumb: ROW-COL first always</li>
    <li>Get data from ROW, then from ROW-COL (.iloc and .loc)</li>
    <li>Make INDEXES UNIQUE, LIKE MAKE COL EMAILS as INDEX!</li>
    <li><b>Sort</b> by indexes</li>
    <li>Filtering</li>
</ol>

In [28]:
import pandas as pd

dummy_dat = {
    'FIRST NAME' : ['John', 'Thomas', 'Bjork', 'Zelenda'],
    'LAST NAME' : ['Doe', 'Troll', 'Bawler', 'DDoe'],
    'AGE' : [43, 32, 27, 17],
    'SALARY' : [90000, 82000, 50000, 12000],
    'EMAIL' : ['hailMary@gg.gg', 'locked@go.off', 'this@that.gg', 'stfu@ggs.com'],
    'HOBBYIST' : ['Yes', 'No', 'Yes', 'No']
}

# Create dummy data frame [ddf]:
ddf = pd.DataFrame(dummy_dat)
ddf

  FIRST NAME LAST NAME  AGE  SALARY           EMAIL HOBBYIST
0       John       Doe   43   90000  hailMary@gg.gg      Yes
1     Thomas     Troll   32   82000   locked@go.off       No
2      Bjork    Bawler   27   50000    this@that.gg      Yes
3    Zelenda      DDoe   17   12000    stfu@ggs.com       No

In [37]:
# Get emails:
emails = [i for i in ddf['EMAIL']] # so this is the list, or you can always use:
emails = ddf['email'] # this is a SERIES and now we can loop through it... longer way but
# you must know there is a possibility to do that too

In [38]:
# Make col names small letters OPTION A:
ddf.columns = [col.lower() for col in ddf.columns]
ddf

  first name last name  age  salary           email hobbyist
0       John       Doe   43   90000  hailMary@gg.gg      Yes
1     Thomas     Troll   32   82000   locked@go.off       No
2      Bjork    Bawler   27   50000    this@that.gg      Yes
3    Zelenda      DDoe   17   12000    stfu@ggs.com       No

In [42]:
# Make col names small letters OPTION B:
ddf.columns = ddf.columns.str.lower()
ddf

  first name last name  age  salary           email hobbyist
0       John       Doe   43   90000  hailMary@gg.gg      Yes
1     Thomas     Troll   32   82000   locked@go.off       No
2      Bjork    Bawler   27   50000    this@that.gg      Yes
3    Zelenda      DDoe   17   12000    stfu@ggs.com       No

In [44]:
# Replace/change spaces to underscore in columns:
ddf.columns = ddf.columns.str.replace(' ', '_')
ddf
# DO NOT CONFUSE .str.replace() and SERIES.replace()
# .str.replace() works as python built-in for string change, while
# SERIES.replace() works for series to change certain DATA, example:
custom_NAN_data = ['Younger than 5 years']
for i in custom_NAN_data:
    z['age1stcode'].replace(i, 5, inplace=True)

  first_name last_name  age  salary           email hobbyist
0       John       Doe   43   90000  hailMary@gg.gg      Yes
1     Thomas     Troll   32   82000   locked@go.off       No
2      Bjork    Bawler   27   50000    this@that.gg      Yes
3    Zelenda      DDoe   17   12000    stfu@ggs.com       No

In [45]:
# Rename specific column names (first_name, last_name):
ddf.rename(columns={'first_name':'name', 'last_name': 'surname'}, inplace=True)
ddf

      name surname  age  salary           email hobbyist
0     John     Doe   43   90000  hailMary@gg.gg      Yes
1   Thomas   Troll   32   82000   locked@go.off       No
2    Bjork  Bawler   27   50000    this@that.gg      Yes
3  Zelenda    DDoe   17   12000    stfu@ggs.com       No

In [50]:
# Accessing data from column and then from 2 columns:
ddf[['salary']] # get data from one col
ddf[['name', 'email']] # get data from few cols

      name           email
0     John  hailMary@gg.gg
1   Thomas   locked@go.off
2    Bjork    this@that.gg
3  Zelenda    stfu@ggs.com

In [51]:
# Lets calulate for fun how much these ppl earned TOGETHER:
ddf['salary'].sum()
# other .sum() useage [for pokemons DF]:
# df['total'] = df[['hp', 'attack', 'defense', 'sp.atk', 'sp.def', 'speed']].sum(axis=1) # the same is: 
# df['total'] = df['hp'] + df['attack'] + df['defense'] + df['sp.atk'] + df['sp.def'] + df['speed']

234000

In [52]:
# Lets create new COL 'full_name' with their first + last name:
ddf['full_name'] = ddf['name'] + ' ' + ddf['surname']
ddf

      name surname  age  salary           email hobbyist     full_name
0     John     Doe   43   90000  hailMary@gg.gg      Yes      John Doe
1   Thomas   Troll   32   82000   locked@go.off       No  Thomas Troll
2    Bjork  Bawler   27   50000    this@that.gg      Yes  Bjork Bawler
3  Zelenda    DDoe   17   12000    stfu@ggs.com       No  Zelenda DDoe

In [55]:
# Count how many Yes and No are in COL 'hobbyist:
ddf['hobbyist'].value_counts()

Yes    2
No     2
Name: hobbyist, dtype: int64

In [57]:
# Delete/Drop COL 'full_name':
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html#pandas.DataFrame.drop
ddf.drop(columns=['full_name'], inplace=True) # COL full_name is gone
ddf

      name surname  age  salary           email hobbyist
0     John     Doe   43   90000  hailMary@gg.gg      Yes
1   Thomas   Troll   32   82000   locked@go.off       No
2    Bjork  Bawler   27   50000    this@that.gg      Yes
3  Zelenda    DDoe   17   12000    stfu@ggs.com       No

In [58]:
# Rule of Thumb: ROW-COL first always - always we read data if we have 2-D ROWs-COLs;

In [65]:
# Get data from ROW, then from ROW-COL:
# .iloc[] - for indexed cordinates or
# .loc[] - for labeled cordinates
# Get data from ROW - .iloc[]:
ddf.iloc[[0]] # gets 1st row

   name surname  age  salary           email hobbyist
0  John     Doe   43   90000  hailMary@gg.gg      Yes

In [66]:
# Get data from ROW - .loc[]:
ddf.loc[[0]] # because indexes are from 0 to n. We will make indexes as string below, but lets show how to get data from ROW-COL

   name surname  age  salary           email hobbyist
0  John     Doe   43   90000  hailMary@gg.gg      Yes

In [69]:
# Get data from ROW-COL - .iloc[]:
ddf.iloc[[0], [0]]

   name
0  John

In [70]:
# Get data from ROW-COL - .loc[]:
ddf.loc[[0], ['name']]

   name
0  John

In [77]:
# Get data from ROW-COL - slices - !NOTICE NO LIST and INCLUSIVE SLICES!:
ddf.loc[0:2, 'name':'salary']

     name surname  age  salary
0    John     Doe   43   90000
1  Thomas   Troll   32   82000
2   Bjork  Bawler   27   50000

In [78]:
# Make INDEXES UNIQUE, LIKE MAKE COL EMAILS as INDEX!:
# ddf.index # returns RangeIndex(start=0, stop=4, step=1)
ddf.set_index('email', inplace=True) # make email as index and perma change DataFrame
ddf.index # proof

Index(['hailMary@gg.gg', 'locked@go.off', 'this@that.gg', 'stfu@ggs.com'], dtype='object', name='email')

In [79]:
ddf # proof 2

                   name surname  age  salary hobbyist
email
hailMary@gg.gg     John     Doe   43   90000      Yes
locked@go.off    Thomas   Troll   32   82000       No
this@that.gg      Bjork  Bawler   27   50000      Yes
stfu@ggs.com    Zelenda    DDoe   17   12000       No

In [80]:
# You can also do a shortcut and set idnexes during object to DataFrame, just add arg: index_col='NAME_OF_UNIQUE_DATA_COL_THAT_WILL_BECOME_AN_INDEX'
# so for example: ddf = pd.DataFrame(SOME_DICT, index_col=...) # you got the point

In [82]:
# SORTING INDEXES - .sort_index():
ddf.sort_index()

                   name surname  age  salary hobbyist
email
hailMary@gg.gg     John     Doe   43   90000      Yes
locked@go.off    Thomas   Troll   32   82000       No
stfu@ggs.com    Zelenda    DDoe   17   12000       No
this@that.gg      Bjork  Bawler   27   50000      Yes

In [88]:
# Filtering:
fltr = (ddf['surname'].str.contains('Doe')) & (ddf['age'] > 33)
ddf.loc[fltr]
# ddf.loc[fltr, ['surname']]

                name surname  age  salary hobbyist
email
hailMary@gg.gg  John     Doe   43   90000      Yes

# END OF SANDBOX
---

### How to split data in COL to other new COLs:

In [95]:
# WE HAD SOME DUMMY DATA:
rdf['full_name'] = rdf['colors'] + ' ' + rdf['adj'] # WE CREATED SOME FULL_NAME COL
rdf.drop(columns={'colors', 'adj'}, inplace=True)   # WE DELETED COLS WHICH FULL_NAME CONSISTED OF
rdf[['name', 'desc']] = rdf['full_name'].str.split(expand=True) # <-- HERE IS A KEY: WE ADDED 2 NEW COL WITH DATA FROM SPLITED COL DATA FULL_NAME
# NOTICE /\ HERE LIST IN LIST notation. I tried at the begining to do with like rdf['name'], rdf['desc'] and it didnt work

        rare      full_name    name    desc
count
222     True  yellow stones  yellow  stones
37     False       blue sky    blue     sky
897    False      red blood     red   blood
22      True    green bones   green   bones

### ADD ROWS of Data:

In [98]:
# currently we have this data:
rdf

        rare      full_name    name    desc
count
222     True  yellow stones  yellow  stones
37     False       blue sky    blue     sky
897    False      red blood     red   blood
22      True    green bones   green   bones

In [106]:
# lets add a ROW - just append mehtod but...:
# rdf.append({'stones': 'dimaond'}) # this will show error, because we did not provided INDEX, we can skip providing INDEX by adding arg:
# ignore_index=True:
rdf.append({'desc':'diamonds'}, ignore_index=True)

   rare      full_name    name      desc
0   1.0  yellow stones  yellow    stones
1   0.0       blue sky    blue       sky
2   0.0      red blood     red     blood
3   1.0    green bones   green     bones
4   NaN            NaN     NaN  diamonds

In [110]:
# you may also add a dataFrame to ROWs. Say we have this dict:
smth = {
    'name':['zuchini', 'crytal'],
    'desc':['lon', 'castle'],
    'count':[15, 22]
}
rdf222 = pd.DataFrame(smth)
rdf222 # NOTICE: that this new DataFrame has different order COLS and diff indexes, but we would like to add it to our rdf DF.

      name    desc  count
0  zuchini     lon     15
1   crytal  castle     22

In [113]:
rdf.append(rdf222, ignore_index=True, sort=False) # LISTEN if we dont have inplace=True arg available, like in this case, we just assign to
# the same DataFrame (like a var)

    rare      full_name     name    desc  count
0   True  yellow stones   yellow  stones    NaN
1  False       blue sky     blue     sky    NaN
2  False      red blood      red   blood    NaN
3   True    green bones    green   bones    NaN
4    NaN            NaN  zuchini     lon   15.0
5    NaN            NaN   crytal  castle   22.0

In [115]:
# so perma change:
rdf = rdf.append(rdf222, ignore_index=True, sort=False)
rdf

    rare      full_name     name    desc  count
0   True  yellow stones   yellow  stones    NaN
1  False       blue sky     blue     sky    NaN
2  False      red blood      red   blood    NaN
3   True    green bones    green   bones    NaN
4    NaN            NaN  zuchini     lon   15.0
5    NaN            NaN   crytal  castle   22.0

In [117]:
# DROPPING ROWs (INDEXES in fact):
# well same drill as droppin a COL but this time keyword is index:
rdf.drop(index=5, inplace=True) # crystal castle is gone
rdf # proof

    rare      full_name     name    desc  count
0   True  yellow stones   yellow  stones    NaN
1  False       blue sky     blue     sky    NaN
2  False      red blood      red   blood    NaN
3   True    green bones    green   bones    NaN
4    NaN            NaN  zuchini     lon   15.0

In [122]:
# say we wanna remove few ROWS with the same name like 'zuchini'. Lets first add rl quick same name row:
rdf = rdf.append({'name':'zuchini', 'desc':'DELETE US!'}, ignore_index=True)

In [123]:
# once we have 2x zuchini lets delete them with our flt combo:

    rare      full_name     name        desc  count
0   True  yellow stones   yellow      stones    NaN
1  False       blue sky     blue         sky    NaN
2  False      red blood      red       blood    NaN
3   True    green bones    green       bones    NaN
4    NaN            NaN  zuchini         lon   15.0
5    NaN            NaN  zuchini  DELETE US!    NaN

In [133]:
flt = rdf['name'] == 'zuchini'
rdf.drop(index=rdf[flt].index) # NOTICE .index IT IS VERY IMPORTANT, NOTICE also index= as a keyword and arg. take a look at data:

    rare      full_name    name    desc  count
0   True  yellow stones  yellow  stones    NaN
1  False       blue sky    blue     sky    NaN
2  False      red blood     red   blood    NaN
3   True    green bones   green   bones    NaN

---
## Sorting Data - how to sort COLs, multiple COLs, grabbing max/min values from ROWs
#### we will use methods: .sort_values(by='COL_NAME')

In [134]:
# Say we wanna sort by COL desc in this DF:
rdf

    rare      full_name    name    desc  count
0   True  yellow stones  yellow  stones    NaN
1  False       blue sky    blue     sky    NaN
2  False      red blood     red   blood    NaN
3   True    green bones   green   bones    NaN

In [136]:
rdf.sort_values(by='desc') # you may use ascending arg for results

    rare      full_name    name    desc  count
2  False      red blood     red   blood    NaN
3   True    green bones   green   bones    NaN
1  False       blue sky    blue     sky    NaN
0   True  yellow stones  yellow  stones    NaN

In [137]:
# Sort by MULTIPLE COLs? Np just add list of cols in by arg:
rdf.sort_values(by=['desc', 'name'])

    rare      full_name    name    desc  count
2  False      red blood     red   blood    NaN
3   True    green bones   green   bones    NaN
1  False       blue sky    blue     sky    NaN
0   True  yellow stones  yellow  stones    NaN

In [148]:
# Sort by MULTIPLE COLs but one must be ASCENDING and other DESCENDING? Np just add a list of boolean to arg ascending=:
rdf.sort_values(by=['count', 'name'], ascending=[True, False]) # ofc if you wanna PERMA MODIFY it, just use extra arg inplace=True :)

    rare      full_name    name    desc  count
0   True  yellow stones  yellow  stones    NaN
2  False      red blood     red   blood    NaN
3   True    green bones   green   bones    NaN
1  False       blue sky    blue     sky    NaN

In [150]:
# also remember, say you have this perma change, so indexes are unsorted, right, you can imply sort by index as you know by:
rdf.sort_index()

    rare      full_name    name    desc  count
0   True  yellow stones  yellow  stones    NaN
1  False       blue sky    blue     sky    NaN
2  False      red blood     red   blood    NaN
3   True    green bones   green   bones    NaN

In [154]:
# lets present sorts on survey.csv data:
df = pd.read_csv('survey.csv')
df.head(2)

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
1,2,I am a developer by profession,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4

In [158]:
# say we wanna sort em by country and salary:
df.sort_values(by=['Country', 'ConvertedComp'], ascending=[True, False]).head(5)

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
61540,62788,I am a developer by profession,Yes,NaN,NaN,Weekly,8.000000e+06,1000000.0,Afghanistan,Albanian lek,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
63925,65381,I am a developer by profession,No,NaN,8,Weekly,8.740000e+09,1000000.0,Afghanistan,Afghan afghani,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.0,30,35
63993,65456,I am a developer by profession,Yes,NaN,Younger than 5 years,Weekly,5.521171e+09,1000000.0,Afghanistan,Afghan afghani,...,NaN,NaN,NaN,"Information systems, information technology, o...",NaN,NaN,NaN,NaN,More than 50 years,More than 50 years
38261,38672,I am a developer by profession,No,NaN,5,Monthly,1.225000e+06,231192.0,Afghanistan,Russian ruble,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,40,40
28270,28374,I am a developer by profession,Yes,NaN,7,Yearly,1.300000e+05,130000.0,Afghanistan,United States dollar,...,Neither easy nor difficult,Appropriate in length,No,Mathematics or statistics,NaN,NaN,Just as welcome now as I felt last year,NaN,17,5

In [162]:
# Maybe we would like to see 10 highest salaries? We can use .nlarbest(INT) method to do so:
df['ConvertedComp'].nlargest(10)

121     2000000.0
123     2000000.0
191     2000000.0
663     2000000.0
697     2000000.0
722     2000000.0
816     2000000.0
982     2000000.0
1018    2000000.0
1032    2000000.0
Name: ConvertedComp, dtype: float64

In [165]:
# you can use it also on DataFrame to see all values, not only salary like above; pass just COL name after comma:
df.nlargest(10, 'ConvertedComp').head(4) # also USE .nsmallest(INT) for smallest

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
121,123,I am a developer by profession,Yes,26.0,12,Weekly,120000.0,2000000.0,United States,United States dollar,...,Easy,Appropriate in length,No,"Computer science, computer engineering, or sof...",Flask;jQuery;React.js,Spring,Just as welcome now as I felt last year,36.0,8,3
123,125,"I am not primarily a developer, but I write co...",Yes,41.0,30,Monthly,200000.0,2000000.0,United States,United States dollar,...,Easy,Appropriate in length,No,NaN,NaN,NaN,Just as welcome now as I felt last year,40.0,11,11
191,193,I am a developer by profession,Yes,29.0,16,Weekly,120000.0,2000000.0,United States,United States dollar,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",NaN,NaN,Just as welcome now as I felt last year,40.0,13,7
663,665,I am a developer by profession,Yes,24.0,13,Weekly,150000.0,2000000.0,United States,United States dollar,...,Neither easy nor difficult,Appropriate in length,No,"A humanities discipline (such as literature, h...",React.js,Express;React.js;Ruby on Rails,Just as welcome now as I felt last year,40.0,4,Less than 1 year

---
## `Grouping` and `Aggregating` - Analyzing and Exploring Your Data
##### Maybe you'd like to know what's the AVRG salary for a Dev is, or how many ppl from each country knows Python or other program lang...
##### `Agregation` - is combining multiple data in a single result.
##### `MEAN (AVRG)` and `MEDIAN (MIDDLE VALUE)`- `MEAN` is average and `MEDIAN` is a middle value of some set, ex: 1 + 2 + 3 = 2 (because MIDDLE value).

In [1]:
import pandas as pd
df = pd.read_csv('survey.csv')

In [27]:
# show mean and median from Series:
x = df['ConvertedComp'].mean()
y = df['ConvertedComp'].median()
print(f'{x:.2f}', ' and ', y)

103756.05  and  54049.0

In [26]:
# as you may suspect, these are for all countries, but we know that different countries varies different payment, so we will group by certain 
# country and then caluclate mean and median. But first let's cover few more basics concepts before we move on to grouping.

In [35]:
# take a look at results now if we do this for DataFrame:
df.median()

Respondent       32231.0
Age                 29.0
CompTotal        63000.0
ConvertedComp    54049.0
WorkWeekHrs         40.0
dtype: float64

In [37]:
df.describe() # this gives us broad overview of some different stats - you may also run it on specific SERIES / COL
# NOTICE: 'count' below means it COUNTS MISSING NAN ROWS

         Respondent           Age      CompTotal  ConvertedComp   WorkWeekHrs
count  64461.000000  45446.000000   3.482600e+04   3.475600e+04  41151.000000
mean   32554.079738     30.834111  3.190464e+242   1.037561e+05     40.782174
std    18967.442360      9.585392            inf   2.268853e+05     17.816383
min        1.000000      1.000000   0.000000e+00   0.000000e+00      1.000000
25%    16116.000000     24.000000   2.000000e+04   2.464800e+04     40.000000
50%    32231.000000     29.000000   6.300000e+04   5.404900e+04     40.000000
75%    49142.000000     35.000000   1.250000e+05   9.500000e+04     44.000000
max    65639.000000    279.000000  1.111111e+247   2.000000e+06    475.000000

In [64]:
df['Sexuality'].value_counts() # lets see how we can caluclate PERCENTAGE of these ppl:

Straight / Heterosexual                                  40118
Bisexual                                                  1918
Gay or Lesbian                                             978
Bisexual;Straight / Heterosexual                           258
Queer                                                      249
Bisexual;Queer                                             191
Gay or Lesbian;Queer                                        90
Straight / Heterosexual;Queer                               56
Bisexual;Gay or Lesbian                                     40
Bisexual;Gay or Lesbian;Straight / Heterosexual;Queer       39
Bisexual;Gay or Lesbian;Queer                               24
Gay or Lesbian;Straight / Heterosexual                      13
Bisexual;Straight / Heterosexual;Queer                      10
Bisexual;Gay or Lesbian;Straight / Heterosexual              8
Name: Sexuality, dtype: int64

In [65]:
df['Sexuality'].value_counts(normalize=True) # this is percentage, just use arg NORMALIZE=TRUE, (91% are Stright/Hetero and so on)...

Straight / Heterosexual                                  0.911939
Bisexual                                                 0.043599
Gay or Lesbian                                           0.022231
Bisexual;Straight / Heterosexual                         0.005865
Queer                                                    0.005660
Bisexual;Queer                                           0.004342
Gay or Lesbian;Queer                                     0.002046
Straight / Heterosexual;Queer                            0.001273
Bisexual;Gay or Lesbian                                  0.000909
Bisexual;Gay or Lesbian;Straight / Heterosexual;Queer    0.000887
Bisexual;Gay or Lesbian;Queer                            0.000546
Gay or Lesbian;Straight / Heterosexual                   0.000296
Bisexual;Straight / Heterosexual;Queer                   0.000227
Bisexual;Gay or Lesbian;Straight / Heterosexual          0.000182
Name: Sexuality, dtype: float64

## Ok fine, we have nice data but how do we know from EACH COUNTRY are they? We gotta find out COUNTRY and this percentage.
## FIRST OF ALL if we'd like to see a specific results BASED ON COUNTRY or based on some other COL, then we gonna to group on that specific COL - we have `GROUPBY` function for this. 
## `Group by` definition (pandas docs): a `group by` operation involves some combination of `SPLIT`ting THE OBJECT + `APPLYIN A FUNC` + and `COMBINING RESULT`

In [70]:
# so lets do EACH of those steps: SPLITTING - APPLYIN A FUNC + COMBINING RES:
df['Country'].value_counts()

United States     12469
India              8403
United Kingdom     3896
Germany            3890
Canada             2191
                  ...
Saint Lucia           1
North Korea           1
Fiji                  1
Lesotho               1
Liechtenstein         1
Name: Country, Length: 183, dtype: int64

In [74]:
# 1. so first we are going to split the object: in this case we wanna group all the RESULTS BY COUNTRY!
country_grp = df.groupby(['Country']) # we get nice DataFrameGroupBy object. 
country_grp
# This means it CONTAINS a bunch of groups

In [76]:
# now we can group a specific group by country name cos we have countries. So lets grab a group USA:
country_grp.get_group('United States').head(3) # here we GRAB SPECIFIC COUNTRY in this GROUP BY. Because Country contains BUNCH OF GROUPS

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
4,5,"I used to be a developer by profession, but no...",Yes,31.0,16,NaN,NaN,NaN,United States,NaN,...,Easy,Too short,No,"Computer science, computer engineering, or sof...",Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8
7,8,I am a developer by profession,Yes,36.0,12,Yearly,116000.0,116000.0,United States,United States dollar,...,Easy,Appropriate in length,No,"Computer science, computer engineering, or sof...",Django;React.js;Vue.js,Flask,Just as welcome now as I felt last year,39.0,17,13
13,14,I am a developer by profession,Yes,27.0,13,Yearly,66000.0,66000.0,United States,United States dollar,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",Angular;Vue.js,Angular;Vue.js,Just as welcome now as I felt last year,40.0,5,1

In [7]:
df.groupby('Country').get_group('United States')['Sexuality'].value_counts(normalize=True) # and here we got stats for USA only :)

Straight / Heterosexual                                  0.881169
Bisexual                                                 0.051311
Gay or Lesbian                                           0.030353
Queer                                                    0.011770
Bisexual;Queer                                           0.008776
Bisexual;Straight / Heterosexual                         0.006091
Gay or Lesbian;Queer                                     0.005059
Straight / Heterosexual;Queer                            0.001962
Bisexual;Gay or Lesbian;Queer                            0.001239
Bisexual;Gay or Lesbian                                  0.000723
Bisexual;Gay or Lesbian;Straight / Heterosexual;Queer    0.000413
Bisexual;Gay or Lesbian;Straight / Heterosexual          0.000413
Bisexual;Straight / Heterosexual;Queer                   0.000413
Gay or Lesbian;Straight / Heterosexual                   0.000310
Name: Sexuality, dtype: float64

In [93]:
country_grp['Sexuality'].value_counts(normalize=True).loc['United States'] # this is the same result as above with different SYNTAX :)

Sexuality
Straight / Heterosexual                                  0.881169
Bisexual                                                 0.051311
Gay or Lesbian                                           0.030353
Queer                                                    0.011770
Bisexual;Queer                                           0.008776
Bisexual;Straight / Heterosexual                         0.006091
Gay or Lesbian;Queer                                     0.005059
Straight / Heterosexual;Queer                            0.001962
Bisexual;Gay or Lesbian;Queer                            0.001239
Bisexual;Gay or Lesbian                                  0.000723
Bisexual;Gay or Lesbian;Straight / Heterosexual          0.000413
Bisexual;Gay or Lesbian;Straight / Heterosexual;Queer    0.000413
Bisexual;Straight / Heterosexual;Queer                   0.000413
Gay or Lesbian;Straight / Heterosexual                   0.000310
Name: Sexuality, dtype: float64

In [27]:
df.groupby('Country').get_group('Poland')['ConvertedComp'].nlargest(10).value_counts() # the largest earning in PL; NOTICE nlargest(INT)

292812.0    1
212625.0    1
337164.0    1
729000.0    1
253100.0    1
911244.0    1
394872.0    1
160000.0    1
151872.0    1
820128.0    1
Name: ConvertedComp, dtype: int64

In [35]:
df.groupby('Country').get_group('Poland')['ConvertedComp'].median()

33408.0

### RUN `MULTIPLE AGGREGATION` FUNC ON A GROUP: say we wanna `median()` and `mean()`:
### use keyword `.agg([LIST_OF_AGGREGATION_FUNCTIONS])` - this is for multiple agg funcs.

In [39]:
df.groupby('Country')['ConvertedComp'].agg(['median', 'mean']) # and also specify a group, say Poland:

                                       median           mean
Country
Afghanistan                           15163.5  148290.125000
Albania                               15900.0   25611.000000
Algeria                                9432.0   10362.812500
Andorra                               88640.0   88640.000000
Angola                                 5292.0    5292.000000
...                                       ...            ...
Venezuela, Bolivarian Republic of...   3600.0    6280.611111
Viet Nam                              10344.0   28342.605769
Yemen                                 36000.0   36000.000000
Zambia                                 5452.0   17506.400000
Zimbabwe                               7200.0   26338.181818

[183 rows x 2 columns]

In [40]:
df.groupby('Country').get_group('Poland')['ConvertedComp'].agg(['median', 'mean'])

median    33408.00000
mean      41857.16792
Name: ConvertedComp, dtype: float64

In [ ]:
#! NOTICE - you can group by few COLs too:
df.groupby(['Country', 'ConvertedComp']).mean()

In [123]:
flt = df['Country'] == 'Poland'
df.loc[flt]['LanguageWorkedWith'].str.contains('Python') # returns BOOLEAN
df.loc[flt]['LanguageWorkedWith'].str.contains('Python').sum() # WE CAN USE .sum() FOR BOOLEAN to find how many ppl knows python

509

### How many % of ppl in each country use Python? :)

In [124]:
# df.groupby('Country')['LanguageWorkedWith'].apply(lambda i: i.str.contains('Python').sum())

In [119]:
country_ppl = df['Country'].value_counts()
country_ppl

United States       12469
India                8403
United Kingdom       3896
Germany              3890
Canada               2191
                    ...
North Korea             1
Fiji                    1
Liechtenstein           1
Marshall Islands        1
Chad                    1
Name: Country, Length: 183, dtype: int64

In [121]:
country_python = df.groupby('Country')['LanguageWorkedWith'].apply(lambda i: i.str.contains('Python').sum())
country_python

Country
Afghanistan                              11
Albania                                  13
Algeria                                  40
Andorra                                   3
Angola                                    1
                                       ...
Venezuela, Bolivarian Republic of...     29
Viet Nam                                102
Yemen                                     1
Zambia                                    4
Zimbabwe                                 13
Name: LanguageWorkedWith, Length: 183, dtype: int64

In [132]:
# CONTACT - conact 2 series into one 
percent_df = pd.concat([country_ppl, country_python], axis=1) # 1 means columns its the same as I would type: axis='columns'. We used
# axis because by default IT WOULD CONCAT BY ROWS
percent_df # ok now lets just add extra COL and we will calc percentage there by dividing (country_python / country_ppl) and * 100

                  Country  LanguageWorkedWith
United States       12469                5964
India                8403                2670
United Kingdom       3896                1621
Germany              3890                1712
Canada               2191                1011
...                   ...                 ...
North Korea             1                   0
Fiji                    1                   0
Liechtenstein           1                   0
Marshall Islands        1                   0
Chad                    1                   0

[183 rows x 2 columns]

In [141]:
percent_df.rename(columns={'Country': 'Ppl', 'LanguageWorkedWith':'Ppl using Python'}, inplace=True)

In [143]:
percent_df['% of ppl using python'] = (percent_df['Ppl using Python'] / percent_df['Ppl']) * 100
percent_df # RESULT

                    Ppl  Ppl using Python  % of ppl using python
United States     12469              5964              47.830620
India              8403              2670              31.774366
United Kingdom     3896              1621              41.606776
Germany            3890              1712              44.010283
Canada             2191              1011              46.143314
...                 ...               ...                    ...
North Korea           1                 0               0.000000
Fiji                  1                 0               0.000000
Liechtenstein         1                 0               0.000000
Marshall Islands      1                 0               0.000000
Chad                  1                 0               0.000000

[183 rows x 3 columns]

In [145]:
percent_df.sort_values(by='% of ppl using python', ascending=False)

,Ppl,Ppl using Python,% of ppl using python
Saint Lucia,1,1,100.000000
"Micronesia, Federated States of...",1,1,100.000000
Gabon,1,1,100.000000
Montenegro,13,9,69.230769
Brunei Darussalam,3,2,66.666667
...,...,...,...
San Marino,2,0,0.000000
Burundi,2,0,0.000000
Saint Vincent and the Grenadines,3,0,0.000000
Gambia,4,0,0.000000
Chad,1,0,0.000000

In [146]:
percent_df.loc['Poland'] # we can now even access specific country :)

Ppl                      1278.000000
Ppl using Python          509.000000
% of ppl using python      39.827856
Name: Poland, dtype: float64

---
### Cleaning Data - Casting Datatypes and Handling Missing Values:

In [1]:
# Almost every Data Set will have some missing values, or data that we would like to clean data.

# DROPPING MISSING VALUES:
import numpy as np
import pandas as pd

ppl = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
    'last': ['Scharper', 'Doe', 'Doe', 'Scharper', np.nan, np.nan, 'Missing'],
    'email': ['CS@aa.bb', 'doejane@aa.aa', 'doejohn@dd.dd', None, np.nan, 'anonym@aa.aa', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

df = pd.DataFrame(ppl)
df

   first      last          email      age
0  Corey  Scharper       CS@aa.bb       33
1   Jane       Doe  doejane@aa.aa       55
2   John       Doe  doejohn@dd.dd       63
3  Chris  Scharper           None       36
4    NaN       NaN            NaN     None
5   None       NaN   anonym@aa.aa     None
6     NA   Missing             NA  Missing

##### `.dropna()` method:
###### it uses default args: `.dropna(axis='index', how='any')`
###### so it if axis would be COLs, then it would drop columns who have missing vals
###### `how` we want to drop it, criteria for dropping a ROW or COL
###### `.dropna(axis='index', how='all')` notice ALL here - this will drop ONLY ROWs with ALL VALUES MISSING

In [2]:
# lets use it without args for now:
df.dropna() # so this will drop ROWs with ANY missing values
# also remember that if you want perma change, then use arg: inplace=True

   first      last          email      age
0  Corey  Scharper       CS@aa.bb       33
1   Jane       Doe  doejane@aa.aa       55
2   John       Doe  doejohn@dd.dd       63
6     NA   Missing             NA  Missing

In [4]:
df.dropna(axis='index', how='all') # this will drop ONLY ROWs with ALL VALUES MISSING

   first      last          email      age
0  Corey  Scharper       CS@aa.bb       33
1   Jane       Doe  doejane@aa.aa       55
2   John       Doe  doejohn@dd.dd       63
3  Chris  Scharper           None       36
5   None       NaN   anonym@aa.aa     None
6     NA   Missing             NA  Missing

In [7]:
# if we use:
# df.dropna(axis='columns', how='any') # THIS WILL RETURN EMPTY result because one ROW has in EVERY COL missing val,
# so it will affect it, but if we change how='all', then it will return the same orignal data frame, because in fact
# ALL columns are not empty, there is like 1 or 2 missing data IN COL but it doesnt count, cos ALL COL data MUST BE
# empty to meet this criteria.

In [14]:
# lets assume we want data only with VALID emails, so we do:
df.dropna(axis='index', how='any', subset=['email']) # NOTICE on index 6 "NA" value, this is CUSTOM ONE and we will
# deal with it below. But focus at the moment at email that was NaN or None got dropped.

   first      last          email      age
0  Corey  Scharper       CS@aa.bb       33
1   Jane       Doe  doejane@aa.aa       55
2   John       Doe  doejohn@dd.dd       63
5   None       NaN   anonym@aa.aa     None
6     NA   Missing             NA  Missing

In [16]:
# you can pass many COLs in list subset arg:
df.dropna(axis='index', how='all', subset=['last', 'email']) 
# all - leaves data if for ex: does have email but doesnt have last name
# any - will drop a row if last or email is NaN/None

   first      last          email      age
0  Corey  Scharper       CS@aa.bb       33
1   Jane       Doe  doejane@aa.aa       55
2   John       Doe  doejohn@dd.dd       63
3  Chris  Scharper           None       36
5   None       NaN   anonym@aa.aa     None
6     NA   Missing             NA  Missing

##### Dealing with CUSTOM `NA` values:

In [17]:
df

   first      last          email      age
0  Corey  Scharper       CS@aa.bb       33
1   Jane       Doe  doejane@aa.aa       55
2   John       Doe  doejohn@dd.dd       63
3  Chris  Scharper           None       36
4    NaN       NaN            NaN     None
5   None       NaN   anonym@aa.aa     None
6     NA   Missing             NA  Missing

In [19]:
# Alright this is the data /\ now we can simply, if its not CSV only custom DICT like we did above, do a simple 
# replace method:
df.replace('NA', np.nan, inplace=True) # see the changes, if you want PERMA CHANGE, use inplace=True
df.replace('Missing', np.nan, inplace=True)

In [20]:
df

   first      last          email   age
0  Corey  Scharper       CS@aa.bb    33
1   Jane       Doe  doejane@aa.aa    55
2   John       Doe  doejohn@dd.dd    63
3  Chris  Scharper           None    36
4    NaN       NaN            NaN  None
5   None       NaN   anonym@aa.aa  None
6    NaN       NaN            NaN   NaN

In [22]:
df.isna() # gives a mask here of values are wether or not classified as NaN vals

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [27]:
# but sometimes you dont want to get rid of all NA custom values. Here is the example:
# teacher in class provided NA val for a student who did not approach the exam, so instead of removing/replacing
# this NA, we want to more likely rename it to 0 for example. We use method
# .fillna('THE_NAME_THAT_WILL_BE_INSERTED_INTO_NA')
df.fillna('MISSING') # or for numerical df.fillna(0)  # see example below:

     first      last          email      age
0    Corey  Scharper       CS@aa.bb       33
1     Jane       Doe  doejane@aa.aa       55
2     John       Doe  doejohn@dd.dd       63
3    Chris  Scharper        MISSING       36
4  MISSING   MISSING        MISSING  MISSING
5  MISSING   MISSING   anonym@aa.aa  MISSING
6  MISSING   MISSING        MISSING  MISSING

In [28]:
df.age.fillna(0, inplace=True) # see what I did here for AGE COL? 
# This is the best solution cos we would use it on GRADES COL
df

   first      last          email age
0  Corey  Scharper       CS@aa.bb  33
1   Jane       Doe  doejane@aa.aa  55
2   John       Doe  doejohn@dd.dd  63
3  Chris  Scharper           None  36
4    NaN       NaN            NaN   0
5   None       NaN   anonym@aa.aa   0
6    NaN       NaN            NaN   0

---
#### CASTING DATA TYPES `.astype(DESIRED_DATA_TYPE)`:

In [29]:
# remember this from above? NOTICE AGE COL - THEY ARE STRING! 
#ppl = {
#    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'],
#    'last': ['Scharper', 'Doe', 'Doe', 'Scharper', np.nan, np.nan, 'Missing'],
#    'email': ['CS@aa.bb', 'doejane@aa.aa', 'doejohn@dd.dd', None, np.nan, 'anonym@aa.aa', 'NA'],
#    'age': ['33', '55', '63', '36', None, None, 'Missing']
#}

# and what if we want to calculate AVRG age? we gotta CAST these datatypes to INT/FLOAT:
# first make sure what datatypes you deal with:
df.dtypes # see age, it means string, and we want numeric like int for example

first    object
last     object
email    object
age      object
dtype: object

In [31]:
# you would get an error if you run: df['age'].mean(), so cast them to numeric:
df['age'] = df['age'].astype(float)
df.dtypes # notice float on age
# NOTE: you can also cast to ALL DATA FRAME if you need: df.astype(int)

first     object
last      object
email     object
age      float64
dtype: object

In [33]:
df['age'].mean()

26.714285714285715

#### Lets back to .replace() from above, remeber we did it only for DICT, not for CSV yet, so lets do it on CSV:
###### we will use extra arg `na_values=NAME_OF_LIST_WITH_SPECIFIED_NA_VALS`

In [37]:
import pandas as pd

df = pd.read_csv('survey.csv', index_col='Respondent')

In [38]:
# if we had some CUSTOM MISSING VALUES in CSV file, then we can create a list of these missin values:
na_vals = ['NA', 'Missing']
# and pass a list of those as argument:
df = pd.read_csv('survey.csv', index_col='Respondent', na_values=na_vals) # extra arg na_values=...

In [46]:
# lets take a look at problem casting values on CSV:
# df['YearsCode'].mean() # we will get an error: can only concatenate str (not "int") to str
# becuase COL 'YearsCode' is actually string, so lets cast it to float:

In [49]:
# df['YearsCode'] = df['YearsCode'].astype(float) # this is another error, it says: 
# could not convert string to float: 'Less than 1 year'
# obviously we dont have just numbers and NaN values, there is actually a string val...
# we will solve it by using .unique() method below ( you could also use .value_counts() and scroll 
# for these unique names)

##### Use a `unique()` method to find unique value in COL:

In [51]:
# df['YearsCode'].value_counts() # like here (note to two lines above)

In [52]:
df['YearsCode'].unique() 
# see all uniques, notice 'Less than 1 year' and 'More than 50 years' those are error throwers:

array(['36', '7', '4', '15', '6', '17', '8', '10', '35', '5', '37', '19',
       '9', '22', '30', '23', '20', '2', 'Less than 1 year', '3', '13',
       '25', '16', '43', '11', '38', '33', nan, '24', '21', '12', '40',
       '27', '50', '46', '14', '18', '28', '32', '44', '26', '42', '31',
       '34', '29', '1', '39', '41', '45', 'More than 50 years', '47',
       '49', '48'], dtype=object)

In [54]:
err_list = ['Less than 1 year', 'More than 50 years']
for i in err_list:
    df['YearsCode'].replace(i, 0, inplace=True)
    
# You could also go longer way like:
# df['YearsCode'] = df['YearsCode'].replace('Less than 1 year', 0, inplace=True) and then
# df['YearsCode'] = df['YearsCode'].replace('More than 50 years', 51, inplace=True)

In [59]:
df['YearsCode'] = df['YearsCode'].astype(float) # now cast to float

In [60]:
df['YearsCode'].mean() # voila! works like a charm

12.582622564315928

---
### Reading/Writing Data to Different Sources - Excel, JSON, SQL

In [61]:
# lets save to CSV our data frame composed from schema.csv:
import pandas as pd
original_data_frame = pd.read_csv('schema.csv')

In [63]:
# and now lets create our data frame from certain fragment of data from its origin:
our_new_df = original_data_frame.head(2)
our_new_df # once we have it, lets save it to CSV:

       Column                                       QuestionText
0  Respondent  Randomized respondent ID number (not in order ...
1  MainBranch  Which of the following options best describes ...

##### WRITE TO `CSV`:

In [64]:
# .to_csv(NAME_LOCATION_PATH_IN_GENERAL...)
# our_new_df.to_csv('exported_data.csv') # and here we have it in our folder :)
# always it will save with EXTRA COL at the begining (the indexes from DF), you can easily get rid of it by:
df.to_csv('FILE_NAME.csv', index=False) # NOTICE arg index=. This is the key
# and important note, .to_csv also WORKS FOR .txt files, but add with extra arg sep='\t' for ex... :
df.to_csv('TXT_FILE.txt', index=False, sep='\t') # and during reading, 
# use .read_csv but this time arg delimiter='\t': .read_csv('TEXT.txt', delimeter='\t')

##### WRITE TO `TSV`:

In [65]:
# sometimes you want to save data to TAB LIMITED FILE, which has extension .tsv:
# our_new_df.to_csv('exported_data.tsv', sep='\t') # NOTICE EXTRA ARG sep=...

##### WRITE TO/READ FROM `EXCEL - pip install xlwt openpyxl xlrd`:

In [67]:
# if you wanna excel, then pip install couple packages:
# pip install xlwt openpyxl xlrd

# WRITING TO EXCEL:
# then just write data to excel with:
# our_new_df.to_excel('exported_data.xlsx') # this might take a while cos its long
# oh and also you can choose to which TAB data should be saved :)

# READING FROM EXCEL:
# test = pd.read_excel('PATH', index_col=...)

##### WRITE TO/READ FROM `JSON`:

In [71]:
# WRITING TO JSON:
# our_new_df.to_json('to_json.json') # or you can add some args for nicer view json once opened:
# our_new_df.to_json('to_json.json', orient='records', lines=True)

# READING FROM JSON:
# test = pd.read_json('JSON_NAME.json', orient='records', lines=True) 
# these extra args might be modified if it will not work well during reading, 
# you can tweak around to remove them or with options

# TID BIT: you can just paste a link to json file, from example from github RAW json file link can 
# be pasted to test = pd.read_json(HTTPS://....)

##### WRITE TO/READ FROM `SQL`:

In [70]:
# you gotta install: pip install SQLAlchemy # FOR SQL ALCHEMY
# and pip install psycopg2-binary            # FOR POSTGRES

# then import libs in your python/jupyer file:
# from sqlalchemy import create_engine
# import psycopg2
# engine = create_engine('postgresql://DB_USER:DB_PASS@localhost:5432/DB_NAME') 
# DO NOT PUT CREDENTIALS in this file, this was for quick
# demonstatrion only, USE TO HIDE CREDENTIAL INSTEAD:
# -----------------------
# from cmd type LINUX/MAX: nano .bash_profile (and define variables DB_... in first lines) then iin your python/jupyter file
# from WINDOWS you gotta just set up LOCAL VARIABLES and named them with DB_... and desired values....
# import os
# os.environ.get('DB_USER')
# os.environ.get('DB_PASS')
# ------------------------

# WRITE TO SQL posgres finally :
# our_new_df.to_sql('NAME_OF_TABLE', engine) # you can use extra ARG if_exists='replace' if table already exists
# or you can even append to a table...

# READ FROM SQL:
# sql_test = pd.read_sql('NAME_OF_TABLE', engine, index_col=...) 

# !RUN a SPECIFC SQL QUERY TO LOAD DATA INSTEAD OF LOADING ENTIRE TABLE! - .read_sql_query()...:
sql_test = pd.read_sql_query('SELEC * FROM ...', engine, index_col=...)

---
### Working with Dates and Time Series Data -- IT'S IN FOLDER ABOVE "date_time_ETH_example"...
#### just navigate to: `../date_time_ETH_example/dates_and_time_series_data.ipynb`

In [32]:
import pandas as pd
l = []

with pd.read_csv('survey.csv', chunksize=10000) as reader:
    for chunk in reader:
        l.append(chunk)
        
ll = pd.concat(l)
ll

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1,I am a developer by profession,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
1,2,I am a developer by profession,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4
2,3,I code primarily as a hobby,Yes,NaN,15,NaN,NaN,NaN,Russian Federation,NaN,...,Neither easy nor difficult,Appropriate in length,NaN,NaN,NaN,NaN,Somewhat more welcome now than last year,NaN,4,NaN
3,4,I am a developer by profession,Yes,25.0,18,NaN,NaN,NaN,Albania,Albanian lek,...,NaN,NaN,No,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat less welcome now than last year,40.0,7,4
4,5,"I used to be a developer by profession, but no...",Yes,31.0,16,NaN,NaN,NaN,United States,NaN,...,Easy,Too short,No,"Computer science, computer engineering, or sof...",Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
64456,64858,NaN,Yes,NaN,16,NaN,NaN,NaN,United States,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,NaN,NaN,10,Less than 1 year
64457,64867,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Morocco,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64458,64898,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Viet Nam,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64459,64925,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Poland,NaN,...,NaN,NaN,NaN,NaN,Angular;Angular.js;React.js,NaN,NaN,NaN,NaN,NaN
64460,65112,NaN,Yes,NaN,NaN,NaN,NaN,NaN,Spain,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",ASP.NET Core;jQuery,Angular;Angular.js;ASP.NET Core;jQuery,NaN,NaN,NaN,NaN

In [ ]:
# just add parameter during readin called chunksize=NUMBER_OF_ROWS (not bytes!):
for df in pd.read_csv("FILE.csv", chunksize=100): ... # this 100 means 100 rows at a time
#
# you could also create empty DF with the same rows as on big data and then fill it, ex:
new_df = pd.DataFrame(columns=big_df.columns) # so this is empty DF with the same COLs as big one
for df in pd.read_csv("FILE.csv", chunksize=100):
    res = df.groupby('SOME_GROUP').count()
    new_df = pd.concat([new_df, res] # so we fill our new DF

In [ ]:
# use .round() to get certain deciaml position:
.round(decimlas=2) # 2 decimals pos.